<template>
	<view class="content">
		<view class="name">
			请选择被询问人类别：
		</view>
		<view class="btn-list">
			<view v-for="(item, index) in list" :key="index" class="btn-list-item">
				<u-button type="primary" @click="details(item)">{{ item.name }}</u-button>
			</view>
		</view>
		
		<view class="home" @click="home">
			首页
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				list: [
					{
						name: '最先发现起火的人和最先报警的人',
						details: '<p>1.发现起火的时间、地点以及最初起火的部位，并且还要了解能够证实起火时间、部位的依据。</p><p>2.发现起火的详细经过，即发现者在什么情况下发现，起火前有什么征相？发现时主要燃烧物质，有什么声、光、味儿等现象，一些可燃物起火后，发出一种特殊的气味儿，这种异常的气味儿，如果引起了人们的注意，也能及时发现起火。动物对于火焰、气味及声响反应比人更灵敏，尤其在夜里，人们多处于熟睡状态，在刚刚发出火焰或异味，以及异响时，动物便会做出鸣叫或逃离反应，这时它们的行为，提醒人们已经起火。</p><p>3.发现起火后火场变化的情况，火势蔓延的方向、燃烧范围，火焰和烟雾的颜色变化情况。</p><p>4.发现火情后采取过哪些灭火措施，现场有无发生变动，变动的原因和情况。</p><p>5.发现起火时还有何人在场，是否有可疑人员出入火场，还有其它什么已知的情况等。</p><p>6.发现起火时电源情况，电灯是否亮，设备是否运转等。一般火灾现场都有电线， 所以一般都要问电的情况。</p><p>7.发现起火时的风向、风力情况。对火灾蔓延有影响。</p><p>8.报警时间、地点及报警过程。</p>'
					},
					{
						name: '最先到达场救火的人',
						details: '<p>1.到火场时火灾发展的形势和特点，冒火、冒烟的具体部位，火焰、烟雾的颜色、气味儿。</p><p>2.到达火场时，火焰蔓延到的位置和扑救的过程。</p><p>3.进入火场、起火部位的具体路线。</p><p>4.扑救过程中是否发现了可疑痕迹、物件和可疑的人出入情况。</p><p>5.起火单位的消防器材和设施是否遭到了破坏。</p><p>6.起火部位在扑救过程中火势如何？是否经过破拆和破坏，原来的状态怎样？</p><p>7.采取何种灭火方式，使用什么灭火剂？作用如何。</p>'
					},
					{
						name: '最先到达到场扑救的消防人员',
						details: '<p>1.火灾现场基本情况（如最先冒烟、冒火部位、塌落倒塌部位、燃烧最猛烈和终止的部位等）。</p><p>2.燃烧特征（烟雾、火焰、颜色、气味儿、响声。）。</p><p>3.现场出现的异常反应，异常的气味、响声等，到达火灾现场时门窗关闭情况，有无强行进入的痕迹。</p><p>4.扑救情况（扑救措施、扑救顺序、力量布置、供水、消防破拆情况等）。</p><p>5.现场设备、设施工作状况，破坏情况等。如室内消火栓有没有水？</p><p>6.是否发现非现场火源，或放火遗留物。</p><p>7.现场其他人活动情况。</p><p>8.现场抢救人情况（死、伤者的位置、状态）。</p><p>9.现场人员向其反映的有关情况。</p><p>10.接警时间、到达火灾现场时间。</p><p>11.扑救时的天气情况，如风力、风向、雷、雨情况。</p><p>12.最初进入火场时，有无对周围环境及起火部位的照相、录像等资料。</p>'
					},
					{
						name: '火灾发生前最后留离开起火部位的人火灾发生时在场的人和受伤人员',
						details: '<p>1.在场时的活动情况，离开起火部位之前是否吸烟或动用了明火，生产设备运转情况，本人具体作业或其他活动内容及活动的位置。</p><p>2.离开时，火源、电源处理情况，是否关闭燃烧气源、电源，附近是否有可燃、易燃物品及自然性物品以及它们的种类、数量、性质。</p><p>3.在工作期间有无违章操作行为，是否发生过故障或异常现象，采取过何种措施。</p><p>4.其他在场人的具体位置和活动内容，何时、何故离去，有无他人来往，来此目的，具体的活动内容及来往的时间，路线。</p><p>5.离开之前是否进行过检查，是否有异常气味和响动，门窗关闭情况。</p><p>6.最后离开起火部位的具体时间、路线、先后顺序，有无证人。</p><p>7.得知发生火灾时间和经过，对火灾原因的见解和依据。</p>'
					},
					{
						name: '熟悉起火现场物品摆放和生产工艺、设备的人',
						details: '<p>1.建筑物的主体和平面布置，建筑的结构耐火性能，每个车间、房间的用途，车间内的设备及室内陈设情况等，起火部位存放、使用的物质情况。</p><p>2.火源、电源和热源等情况，火源分布的部位及与可燃材料、物体的距离，有无不正常情况，是否采取过防火措施；架设线路的部位，电线是否合乎规格、使用年限，有没有破、损、漏电现象，负荷是否正常。</p><p>3.设备及工艺情况和安全制度执行情况。近期检查、修理、改造情况，机械设备的性能、使用情况和发生的故障情况等，都应该了解清楚，以便推断出可能起火的物体和设备。</p><p>4.储存物资的情况。起火部位存放使用的物资，材料产品情况（包括种类、数量、相互位置）。如起火的房间或库房内，是否有性能相互抵触的化学物质和自然物品；可燃性物品与电源、火源的关系，库内的通风是否良好？温度、湿度是否适当，以及是否漏雨、漏雪等。</p><p>5.有无火灾史，曾在什么时间、部位、地点，什么原因发生过火灾或其他事故，事后采取过什么措施。</p><p>6.设备及工艺情况，以及生产及设备运转情况。</p><p>7.有无防火安全规定、制度和操作规程，实际执行情况如何？有关制度和规程是否与新工艺、新设备相适应？</p><p>8.有哪些不正常现象，如设备、控制装置及灯火闪动、异响、异味儿等。</p>'
					},
					{
						name: '火灾肇事嫌疑者、责任制',
						details: '<p>1.用火用电、操作作业等的详细过程，有无因本人生产、生活用电不慎，疏忽大意，违反安全操作规程而引起火灾的可能，火灾当时及火灾前，火灾责任者和受伤人当时在何处、何位置、做什么、肇事前和受灾后的主要活动情况。</p><p>2.起火部位可燃物情况、品种、种类和火源距离等。</p><p>3.起火过程及扑救逃生情况。</p><p>4.受伤的部位、原因。</p><p>5.对居民火灾，还要了解其社会关系、邻里关系等。</p>'
					},
					{
						name: '起火单位的有关领导',
						details: '<p>1.向起火单位领导主要了解对起火原因的看法，如存在的内部矛盾，提供可疑人、重点人等。</p><p>2.安全制度的执行情况。</p><p>3.火灾隐患及整改情况。</p><p>4.以往火灾及其他事故方面的情况。</p><p>5.起火前生产中有无故障及处理情况。</p><p>6.起火场所相关人员的上岗培训、职业技能、健康情况。</p>'
					},
					{
						name: '起火现场，当班人员或巡查人员',
						details: '<p>1.交接班时间、记录、巡查记录。</p><p>2.检查情况。检查时间、检查部位、检查线路、检查次数、有无反常情况及处理情况。</p><p>3.用火、用电情况，如本人吸烟、照明情况等。</p><p>4.发现起火经过、火势情况和采取的措施。</p><p>5.有无人员进出及具体时间。</p><p>6.值班巡查制度、措施。</p>'
					},
					{
						name: '相邻单位目击者和附近群众',
						details: '<p>1.起火当时和起火前后，他们耳闻目睹的有关情况，如发现起火的部位、范围、火势情况，起火前火源、电源的反常情况，是否发现可疑物等。</p><p>2.群众对起火的各种反应、议论、情绪及其他活动。</p><p>3.当事人的有关情况。如政治、经济、作风和思想品质等家庭和社会关系，火灾前后的行为表现等。</p><p>4.当地地理环境特点、社会风土民情、人员往来情况等。</p><p>5.以往发生火灾及其他事故和案件情况。</p><p>6.发现火灾时，有无照、相录像等资料。</p>'
					},
					{
						name: '辖区消防监督人员',
						details: '<p>1.对该场所日常消防监督情况。</p><p>2.该场所消防设施设置及运行情况。</p><p>3.火灾隐患检查整改情况。</p><p>4.起火单位日常消防安全管理情况。</p>'
					},
					{
						name: '火灾受害人',
						details: '<p>1.损失情况（建筑、设备、家具、物品等损失）。</p><p>2.与起火场所业主或火灾肇事人的关系，是否存在矛盾纠纷、经济往来、商业竞争。</p><p>3.建筑结构、分隔情况、电气线路敷设与起火场所的关系。</p><p>4.如何得知起火信息。</p><p>5.对起火原因的看法及起火场所的相关情况。</p>'
					},
					{
						name: '其他与火灾有关联或了解火灾相关情况的人',
						details: ''
					}
				]
			}
		},
		methods: {
			details(item) {
				if (item.details !== '') {
					uni.navigateTo({
						url: './details?data=' + JSON.stringify(item)
					})
				} else {
					// uni.navigateTo({
					// 	url: '../askType/index'
					// })
					console.log(123456)
				}
				
			},
			home() {
				uni.switchTab({
					url: '../../index/index'
				})
			}
		}
	}
</script>

<style lang="scss" scoped>
	.content{
		padding: 20rpx 20rpx 150rpx;
		position: relative;
		
		.name{
			line-height: 100rpx;
		}
		
		.btn-list{
			.btn-list-item{
				margin-bottom: 20rpx;
			}
		}
		
		.home{
			position: fixed;
			left: 0;
			bottom: 0;
			width: 100%;
			height: 100rpx;
			border-top: 1px solid #ccc;
			background-color: #fff;
			display: flex;
			align-items: center;
			text-align: center;
			justify-content: center;
			z-index: 999;
		}
	}
</style>
