<template>
		<view class="content">
			<view class="name">
				火灾调查询问笔录的技巧
			</view>
			<view class="details">
				<text>调查询问重点不是追查责任，而是为了通过询问，了解火灾发生、发展的过程以及火灾现场的原始状态，目的是要查明起火点、起火时间、起火部位、起火原因等问题。</text>
				<text>1.调查询问笔录前的准备工作</text>
				<text>（1）一定先了解情况，对关键环节作出判断。这一要领在于快速判断关键环节，争取在做笔录前十分有限的时间里多了解火灾情况，同时抓住时机收集提取固定其它证据。</text>
				<text>（2）一定先列提纲，对本次笔录要问的内容、要调查解决的问题做到心中有数。这样可以增强笔录的目的性、条理性和逻辑性。</text>
				<text>（3）排除干扰，搞好心理调节。调查人员要有吃苦耐劳、求真务实的工作作风。调查访问时和蔼的态度能促使被访问人对调查人员产生好感和信任，缓和谈话的紧张气氛，便于回忆。</text>
				<text>2.做好火灾调查询问笔录的一些技巧</text>
				<text>做火灾调查询问笔录除了程序、格式要符合要求外，要想做好，还要掌握一些技巧，或者说方法。</text>
				<text>（1）及时性</text>
				<text>发生火灾以后，要立即奔赴火灾现场，开展火灾事故调查，错过最佳调查时间，达现场时围观群众早已散去，这样调查人员可能就无法立刻了解到火灾的真实情况。</text>
				<text>火灾事故调查，应及时奔赴现场，静态观察现场，立即开展，立即做调查走访，做好询问笔录，好的开端是火灾事故调查成功的关键。同时调查走访中要注意收集其他人包括周围群众的照片、录像。</text>
				<text>（2）反复询问</text>
				<text>火灾事故调查常常需要配合火灾现场勘验针对同一个人、同一件事反复询问、补充询问，才能火灾事故的了解不断深入。火灾调查人员要想对火灾了解不断深入，就必须要有不怕麻烦的思想，对一个人进行反复询问。</text>
				<text>（3）火灾调查人员人手不够，怎么做询问笔录？当事人自己写看到火灾事实，自述的材料也可以当询问笔录用。</text>
				<text>（4）做询问笔录时有些东西要画图说明</text>
				<text> 许多火灾现场的情况，询问笔录用语言叙述，非常麻烦，而且不生动、不形象，也不便于理解，但是画了示意图以后看起来就很容易理解所以做询问笔录时有些东西要画图说明，所以做询问笔录时有些东西要画图说明。另外在示意图上，画的人画完后应该写：此图是我所画，然后签名、签日期。</text>
				<text>（5）询问笔录中的录音与录像</text>
				<text>火灾事故调查中许多重要的证人、火灾当事人、火灾肇事嫌疑人做询问笔录时，都应录音、录像。因为做询问笔录时，有时有些东西你可能认为不重要，就没有记录。但是随着后期调查的深入发现一些东西很重要，但这时直接去做询问笔录就比较难，但有录音、录像就容易的多，而且录音、录像也属于证据。</text>
				<text>（6）如何寻找关键的人证？</text>
				<text>有些火灾，一些能够证明起火部位、起火点的关键证人没有，或者虽然有但由于所在位置受限看不清楚，而知道火灾事故事实的火灾责任、肇事嫌疑人、当事人拒不交代具体情况，或者推说不清楚，那么如何找到其他的关键性证人？</text>
				<text>火灾发生时及时到现场，通过走访火灾现场周围的群众；查看报纸、网络上的新闻、视频、火灾现场周围的监控录像等方法找到关键证人。</text>
				<text>（7）采取适当的技巧询问</text>
				<text> 1）被询问者记不清情况。在询问时，可以根据形势合理组合，以提高询问效果，如帮助联想，刺激回忆，证据问答等，尽可能让被询问者回想起更多的事故现场状况</text>
				<text>例如发现火灾前，听到什么异常的声音？闻到什么气味？让被询问者观看某一段儿视频，询问他相关的情况。也可以让被询问者到火灾现场来回忆。询问起火时间。当时是几点打的电话和发的短信的？</text>
				<text>2）被询问者在说谎掩盖事实时</text>
				<text>他们谎言的描述经常会缺乏具体的描述，在细节上讲述不清晰。一个谎言，需要无数的谎言去自圆其说，在他圆谎的过程中可能会出现各种漏洞，仔细倾听，判断被询问者语言前后的逻辑是否有问题，是否与之前调查结果有冲突的地方。由此我们可以判断他是否说谎了。</text>
				<text>3）拒不交代或者作伪证</text>
				<text>讲清法律责任，拒不交代或作伪证应负的法律责任，同时结合提供其他的人证、物证的等证据，施加压力。对这些拒不交代事实的人，一般会在再次询问前，进行其他的人走访，掌握其它大量的人证、物证，最后寻找突破，也可以先从其他次要的人身上寻找突破。</text>
				<text>（8）有些小火灾要按大火灾来调查</text>
				<text>有些小火灾，看着面积不大，损失也不大，但是要查清火灾真实情况，其实很复杂，调查起来并不简单。现场勘查倒是很快、很简单，但要做大量的走访和询问笔录等。有时小的火灾，要按照大的火灾方法来进行调查，该进行的程序、下的功夫，跟大火灾一样，否则就可能查不清事实，到时候这个火灾就把你黏上了。</text>
			</view>
			
			<view class="home" @click="home">
				首页
			</view>
		</view>
</template>

<script>
	export default {
		methods: {
			home() {
				uni.switchTab({
					url: '../../index/index'
				})
			}
		}
	}
</script>

<style lang="scss" scoped>
	.content{
		padding: 20rpx 20rpx 150rpx;
		position: relative;
		.name{
			font-size: 38rpx;
			font-weight: bold;
			line-height: 100rpx;
		}
		.details{
			text{
				display: inline-block;
				margin-bottom: 20rpx;
				line-height: 55rpx;
				text-indent: 2em;
				
				span{
					font-size: 36rpx;
					font-weight: bold;
				}
			}
			
			.next{
				margin: 50rpx 0;
			}
		}
		
		.home{
			position: fixed;
			left: 0;
			bottom: 0;
			width: 100%;
			height: 100rpx;
			border-top: 1px solid #ccc;
			background-color: #fff;
			display: flex;
			align-items: center;
			text-align: center;
			justify-content: center;
			z-index: 999;
		}
	}
</style>
